cask_args appdir: '/Applications'

tap 'homebrew/bundle'

# Shell enhancements
brew 'atuin'       # Better shell history
brew 'zoxide'      # Smarter cd command
brew 'fzf'         # Fuzzy finder
brew 'eza'         # Modern ls replacement

# Development tools
brew 'fnm'         # Fast Node Manager
brew 'watchman'    # File watcher for React Native

# System tools
brew 'cloudflared'
brew 'imagemagick'
brew 'postgresql@17'
brew 'redis'
brew 'ruby-build'
brew 'spaceman-diff'
brew 'spark'
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'wget'
brew 'yt-dlp'

cask '1password'
cask 'airtable'
cask 'arq'
cask 'diffusionbee'
cask 'ghostty'
cask 'handbrake-app'
cask 'messenger'
cask 'notion-calendar'
cask 'plex'
cask 'qlvideo'
cask 'sonos'
cask 'steam'
cask 'transmission'
cask 'raycast'
cask 'whatsapp'
cask 'windsurf'
cask 'visual-studio-code'
cask 'vlc'
cask 'zed'
cask 'zoom'
