cask_args appdir: '/Applications'

# Shell enhancements
brew 'curl'               # Update the system curl
brew 'atuin'              # Better shell history
brew 'zoxide'             # Smarter cd command
brew 'fzf'                # Fuzzy finder
brew 'eza'                # Modern ls replacement
brew 'bat'                # Better cat with syntax highlighting
brew 'ripgrep'            # Fast grep
brew 'fd'                 # Fast find
brew 'lazygit'            # Git TUI (nvim integration)
brew 'nvim'               # Neovim
brew 'tmux'               # Terminal multiplexer
brew 'yazi'               # File manager

# Development tools
brew 'fnm'                # Fast Node Manager
brew 'watchman'           # File watcher for React Native
brew 'uv'                 # Python package and project manager
brew 'rbenv'              # Ruby version manager
cask 'zulu@17'            # Java 17 for Android development
brew 'awscli'
brew 'fvm'                # Flutter version manager

# System tools
brew 'imagemagick'        # Image processing
brew 'ffmpeg'             # Video processing
brew 'sevenzip'           # Archive manager
brew 'wget'               # Network downloader
brew 'jq'                 # JSON processor
brew 'poppler'            # PDF processing
brew 'resvg'              # SVG processing
brew 'yt-dlp'             # YouTube downloader
brew 'grc'                # Colorize command output

# MacOS Input Source Manager
brew 'macism'
cask 'input-source-pro'

# GUI applications
cask 'ghostty'            # Terminal emulator
cask 'notion'             # Note-taking app
cask 'wechat'             # Messaging app
cask 'visual-studio-code' # Code editor
cask 'snipaste'           # Screenshot tool
cask 'loop'               # Window management tool
cask 'mac-mouse-fix'      # Make Your $10 Mouse Better Than an Apple Trackpad
cask 'beekeeper-studio'   # Database management tool

# Font for terminal
cask 'font-jetbrains-mono-nerd-font'
cask 'font-noto-sans-cjk-sc'
